---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteDifferentViewSpecificElements
source: html/e0f1506e-84f0-e950-748f-a590bacd35a3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteDifferentViewSpecificElements Property

Cannot paste view-specific elements from different views.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteDifferentViewSpecificElements { get; }
```